Repository: mixxorz/django-service-objects
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru_ru

source: Input is required. Expected not empty list but got %(values)r.
ru_ru: Входной параметр обязателен. Ожидается непустой список, но получено %(values)r.

source: %(cls_name)s(%(model_class)r) is invalid. First parameter of ModelField must be either a model or a model name.
ru_ru: %(cls_name)s(%(model_class)r) некорректно. Первый параметр ModelField должен быть моделью или именем модели.

source: Objects needs to be of type %(model_class)r
ru_ru: Объекты должны быть типа %(model_class)r

source: Unsaved objects are not allowed.
ru_ru: Несохраненные объекты не разрешены.

source: Input is required. Expected model but got %(value)r.
ru_ru: Входной параметр обязателен. Ожидается модель, но получено %(value)r.

source: Object is not iterable.
ru_ru: Объект не является итерируемым.

source: Input is required expected list of models but got %(values)r.
ru_ru: Входной параметр обязателен и ожидается список моделей, но получено %(values)r.

source: Input is required. Expected dict but got %(value)r.
ru_ru: Входной параметр обязателен. Ожидается словарь, но получено %(value)r.

source: Input needs to be of type dict.
ru_ru: Входной параметр должен быть типа словарь.

source: Input is required. Expected list but got %(value)r.
ru_ru: Входной параметр обязателен. Ожидается список, но получено %(value)r.

source: Input needs to be of type list.
ru_ru: Входной параметр должен быть типа список.
